package org.example.variables_lesson2.homework;

public class FirstTask {
    /*
    В методе main класса Main создайте 5 переменных типа String: dumbledore,
    mcgonagall, snape, lupin, hugrid. Присвойте каждой переменной значение,
    соответствующее ее названию. Должны получиться поля, содержащие имена
    знаменитых волшебников.

    Затем создайте еще одну строку с названием teachers, содержащую текст:
    “School teachers:“. Обратите внимание, в тексте содержится двоеточие.

    Выведите на экран сначала строку teachers, затем все 5 строк с именами
    преподавателей. Должен получиться список учителей.
     */
}
