package org.example.variables_lesson2.homework;

public class SecondTask {
    /*
    Теперь представим, что Макгонагалл выставляет оценки за работу с помощью
    магического пера. Перо умеет проверять само — оно отлично знает материал.

    Давайте поставим оценки за две работы. Для этого будем использовать класс Random.

    С помощью new Random().nextInt(1, 10) сгенерируйте 2 разных числа grade1, grade2.
    Обратите внимание, что класс Random вообще призван, чтобы всегда генерировать
    случайное число. Тут мы указали конкретный диапазон, потому что работу можно
    оценить от 1 до 10. Но можно диапазон и не указывать. Каждый раз, когда мы будем
    вызывать этот метод, будет генерироваться новое число.

    Теперь давайте проверим, что оба числа больше 5 — это приемлемая для сдачи
    работы оценка. Используем операции сравнения и &&, чтобы выполнить две проверки
    на одной строчке. Результат выполнения записываем в переменную типа boolean c
    названием result. Затем выводим result на экран. Так, если оба числа были больше 5,
    в результате мы должны получить true. Чтобы проверить, какими были числа, можно
    перед операцией сравнения тоже вывести их на экран.

    Затем посчитаем средний балл: сложим две оценки и разделим на два. Подумайте,
    какой тип данных может получиться в итоге? Результат также вывести на экран.

    Запустите приложение несколько раз, посмотрите, как изменяются данные в консоли.
    */
}
